Resources/fixtures/trading/payment/payment.yaml

payment_number: 1657955112
collector: 254289619
currency_id: BRL
status: approved
status_code: 2
status_detail: accredited
transaction_amount: 243.9
transaction_net_amount: 204.88
shipping_cost: 0
overpaid_amount: 0
total_paid_amount: 243.9
marketplace_fee: 39.02
coupon_amount: 0
date_created: '2016-12-09T09:47:39.000-04:00'
date_last_modified: '2016-12-12T06:46:29.000-04:00'
card_id: ''
reason: ''
activation_uri: ''
payment_method_id: bolacme
installments: 1
issuer_id: 0
atm_transfer_reference:
    company_id: 0
    transaction_id: 0
coupon_id: ''
operation_type: regular_payment
payment_type: ticket
available_actions: {  }
installment_amount: 0
deferred_period: ''
date_approved: '2016-12-12T06:46:29.000-04:00'
authorization_code: ''
transaction_order_id: '6485856515'
tags: {  }
expands:
    payer:
        type: registered
        id: '179119340'
        identification:
            type: CPF
            number: 59817473074
        email: null
        phone:
            area_code: ' '
            number: '4199476784'
            extension: null
        first_name: Wile
        last_name: 'E. Coyote'
        entity_type: null
